{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "<unk>",
        0.0
      ],
      [
        "<pad>",
        0.0
      ],
      [
        "▁",
        -2.1870685866475306
      ],
      [
        "E",
        -2.753297379800477
      ],
      [
        "S",
        -2.8252153382493894
      ],
      [
        "T",
        -2.9887735898920003
      ],
      [
        "I",
        -3.10437252451292
      ],
      [
        "A",
        -3.1629293774439287
      ],
      [
        "O",
        -3.451339450082159
      ],
      [
        "D",
        -3.476825889450767
      ],
      [
        "R",
        -3.673048305739112
      ],
      [
        "N",
        -3.67420154752695
      ],
      [
        "▁THE",
        -3.683257859164218
      ],
      [
        "L",
        -3.747104416935077
      ],
      [
        "P",
        -4.009322780168336
      ],
      [
        "M",
        -4.029926623755138
      ],
      [
        "U",
        -4.072350333815196
      ],
      [
        "Y",
        -4.123356017262026
      ],
      [
        "F",
        -4.204374248455178
      ],
      [
        "C",
        -4.283401263732662
      ],
      [
        "G",
        -4.2881307712566095
      ],
      [
        "H",
        -4.409150720091207
      ],
      [
        "W",
        -4.468556569418894
      ],
      [
        "ED",
        -4.494171052533959
      ],
      [
        "▁AND",
        -4.517157996480197
      ],
      [
        "▁TO",
        -4.588897086373596
      ],
      [
        "▁OF",
        -4.593657554188454
      ],
      [
        "ER",
        -4.6233311838383635
      ],
      [
        "ING",
        -4.682046697046799
      ],
      [
        "AN",
        -4.751442265130025
      ],
      [
        "RE",
        -4.792514204719836
      ],
      [
        "K",
        -4.864844260364263
      ],
      [
        "▁IN",
        -4.943789874802729
      ],
      [
        "AR",
        -4.964460673642034
      ],
      [
        "IN",
        -5.019123133742422
      ],
      [
        "▁HE",
        -5.118516655817414
      ],
      [
        "B",
        -5.147877741845928
      ],
      [
        "ON",
        -5.159485558932229
      ],
      [
        "▁BE",
        -5.2068215291337285
      ],
      [
        "OR",
        -5.405542970189497
      ],
      [
        "CE",
        -5.425155107712756
      ],
      [
        "LY",
        -5.435752194494622
      ],
      [
        "CH",
        -5.447225023856946
      ],
      [
        "VE",
        -5.468046291778856
      ],
      [
        "▁THAT",
        -5.487972599428661
      ],
      [
        "LL",
        -5.494702938185366
      ],
      [
        "V",
        -5.500590607576278
      ],
      [
        "▁IT",
        -5.5067850026110605
      ],
      [
        "▁TH",
        -5.525368097900538
      ],
      [
        "UR",
        -5.532395646917944
      ],
      [
        "▁WAS",
        -5.540509066611051
      ],
      [
        "AL",
        -5.541538415746418
      ],
      [
        "UN",
        -5.601897680073485
      ],
      [
        "▁YOU",
        -5.626308693763745
      ],
      [
        "▁MA",
        -5.6506508355424785
      ],
      [
        "ENT",
        -5.664045012152322
      ],
      [
        "VER",
        -5.706303848865913
      ],
      [
        "▁FOR",
        -5.70987378723629
      ],
      [
        "▁HIS",
        -5.762877101728344
      ],
      [
        "▁ON",
        -5.775034150780636
      ],
      [
        "▁WITH",
        -5.804022323554234
      ],
      [
        "▁AS",
        -5.805832194260814
      ],
      [
        "▁CA",
        -5.913634574669828
      ],
      [
        "▁HER",
        -5.948953496080502
      ],
      [
        "▁WH",
        -5.956815792956659
      ],
      [
        "▁RE",
        -5.9728537411166975
      ],
      [
        "▁MO",
        -6.004379848237365
      ],
      [
        "▁ME",
        -6.017924413223232
      ],
      [
        "▁DO",
        -6.035843228607021
      ],
      [
        "▁HAD",
        -6.040804669900359
      ],
      [
        "TION",
        -6.04584872450992
      ],
      [
        "▁NOT",
        -6.047095642672627
      ],
      [
        "▁HA",
        -6.0533095750179555
      ],
      [
        "THER",
        -6.093492066507787
      ],
      [
        "▁SO",
        -6.09962945120164
      ],
      [
        "▁BUT",
        -6.132769912713735
      ],
      [
        "▁NO",
        -6.135158745074381
      ],
      [
        "▁IS",
        -6.140323552674074
      ],
      [
        "▁WE",
        -6.16280540483363
      ],
      [
        "▁SHE",
        -6.191878951685538
      ],
      [
        "▁AT",
        -6.211077357254901
      ],
      [
        "▁HIM",
        -6.2519350346849
      ],
      [
        "CK",
        -6.313327321727785
      ],
      [
        "J",
        -6.318655427395274
      ],
      [
        "▁SU",
        -6.320353486211287
      ],
      [
        "UGH",
        -6.336800774275471
      ],
      [
        "▁GO",
        -6.33823186163583
      ],
      [
        "▁WA",
        -6.4131630534563975
      ],
      [
        "▁LI",
        -6.421069265691944
      ],
      [
        "▁CO",
        -6.442662505839955
      ],
      [
        "▁MY",
        -6.478187992505086
      ],
      [
        "▁LA",
        -6.4829086767791235
      ],
      [
        "▁ALL",
        -6.486998275185812
      ],
      [
        "▁PA",
        -6.487260044064824
      ],
      [
        "▁SH",
        -6.511057300447709
      ],
      [
        "▁CON",
        -6.522214882855957
      ],
      [
        "▁HAVE",
        -6.524642468614115
      ],
      [
        "▁BY",
        -6.53989555682273
      ],
      [
        "▁THIS",
        -6.562156696625442
      ],
      [
        "▁WHICH",
        -6.580079037091174
      ],
      [
        "BLE",
        -6.601188813649907
      ],
      [
        "Q",
        -6.612765404130242
      ],
      [
        "▁SAID",
        -6.637671340312297
      ],
      [
        "▁FROM",
        -6.639632153637336
      ],
      [
        "▁UP",
        -6.642057963544305
      ],
      [
        "▁PO",
        -6.6922686377100895
      ],
      [
        "▁BO",
        -6.6969922133490165
      ],
      [
        "▁BR",
        -6.697863408420984
      ],
      [
        "▁EX",
        -6.720727000547791
      ],
      [
        "▁WHEN",
        -6.888898471337855
      ],
      [
        "▁PRO",
        -6.942176523936919
      ],
      [
        "▁WOULD",
        -6.951105719564817
      ],
      [
        "▁MIS",
        -6.970877603104027
      ],
      [
        "▁WHAT",
        -6.975944981646988
      ],
      [
        "▁OUT",
        -7.026057465732187
      ],
      [
        "▁WILL",
        -7.042555169140416
      ],
      [
        "'",
        -7.0768982096072275
      ],
      [
        "SELF",
        -7.097212836997711
      ],
      [
        "X",
        -7.108516997659075
      ],
      [
        "Z",
        -7.163299440126343
      ],
      [
        "▁COULD",
        -7.253579956266767
      ],
      [
        "▁KNOW",
        -7.346050769555935
      ],
      [
        "▁LITTLE",
        -7.454773663819024
      ],
      [
        "▁LOOK",
        -7.463187485749323
      ],
      [
        "▁ABOUT",
        -7.5340832394172335
      ],
      [
        "▁GREAT",
        -7.582962271732558
      ],
      [
        "▁AGAIN",
        -7.593362700126759
      ],
      [
        "▁SHOULD",
        -7.636902554209582
      ]
    ],
    "byte_fallback": false
  }
}